src/com/shuohe/GuoNengBattery/SendInstantSms.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:ful="http://schemas.datacontract.org/2004/07/FullScreen.Models">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:GetAllSerializedRealTimeCarParameter>
         <tem:terminals>
            <ful:RealTimeTerminaItem>
               <ful:HasDbcParameter>true</ful:HasDbcParameter>
               <ful:TerminalCode>50007445</ful:TerminalCode>
            </ful:RealTimeTerminaItem>      
            <ful:RealTimeTerminaItem>
               <ful:HasDbcParameter>true</ful:HasDbcParameter>
               <ful:TerminalCode>50007556</ful:TerminalCode>
            </ful:RealTimeTerminaItem>
            <ful:RealTimeTerminaItem>
               <ful:HasDbcParameter>true</ful:HasDbcParameter>
               <ful:TerminalCode>50007555</ful:TerminalCode>
            </ful:RealTimeTerminaItem>
            <ful:RealTimeTerminaItem>
               <ful:HasDbcParameter>true</ful:HasDbcParameter>
               <ful:TerminalCode>50007550</ful:TerminalCode>
            </ful:RealTimeTerminaItem>
            <ful:RealTimeTerminaItem>
               <ful:HasDbcParameter>true</ful:HasDbcParameter>
               <ful:TerminalCode>50007450</ful:TerminalCode>
            </ful:RealTimeTerminaItem>
            <ful:RealTimeTerminaItem>
               <ful:HasDbcParameter>true</ful:HasDbcParameter>
               <ful:TerminalCode>50007444</ful:TerminalCode>
            </ful:RealTimeTerminaItem>
            <ful:RealTimeTerminaItem>
               <ful:HasDbcParameter>true</ful:HasDbcParameter>
               <ful:TerminalCode>50007449</ful:TerminalCode>
            </ful:RealTimeTerminaItem>
            <ful:RealTimeTerminaItem>
               <ful:HasDbcParameter>true</ful:HasDbcParameter>
               <ful:TerminalCode>50007447</ful:TerminalCode>
            </ful:RealTimeTerminaItem>
            <ful:RealTimeTerminaItem>
               <ful:HasDbcParameter>true</ful:HasDbcParameter>
               <ful:TerminalCode>50007446</ful:TerminalCode>
            </ful:RealTimeTerminaItem>
            <ful:RealTimeTerminaItem>
               <ful:HasDbcParameter>true</ful:HasDbcParameter>
               <ful:TerminalCode>50007443</ful:TerminalCode>
            </ful:RealTimeTerminaItem>
            <ful:RealTimeTerminaItem>
               <ful:HasDbcParameter>true</ful:HasDbcParameter>
               <ful:TerminalCode>50007438</ful:TerminalCode>
            </ful:RealTimeTerminaItem>     
         </tem:terminals>
      </tem:GetAllSerializedRealTimeCarParameter>
   </soapenv:Body>
</soapenv:Envelope>